## Stack - Projeto Human Resources Analytics

#### Modelagem de Dados

##### Importando as bibliotecas necessárias

In [1]:
import pandas as pd
import datetime
import glob 
import math

##### Instalando a biblioteca para conexão com o Banco de Dados

In [2]:
# !pip install pymysql

##### Conexão com o banco de dados

In [3]:
from sqlalchemy.engine import create_engine
engine = create_engine('mysql+pymysql://root:stack@127.0.0.1:3307/employees')

### Criação dos atributos satisfation Level e Last Evaluation

#### Carregando os dados de avaliação de desempenho

In [4]:
df_performance_evaluation = pd.read_json("../arquivos/performance-evaluation/employee_performance_evaluation.json", orient='records', lines=True)

In [5]:
df_performance_evaluation.head()

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

#### Criando o atributo Number_Project

##### Definindo a query para retornar o número de projetos por colaborador

In [6]:
query = """SELECT EMP_ID AS id_emp, COUNT(PROJECT_ID) AS number_projects FROM employees.projects_emp GROUP BY EMP_ID;"""

In [7]:
df_number_projects = pd.read_sql_query(query, engine)

In [8]:
df_number_projects.head()

   id_emp  number_projects
0   10001                2
1   10002                5
2   10003                7
3   10004                5
4   10005                2

#### Criação do atributo Mean_Work_Last_3_Months

##### Criando uma estrutura de DataFrame vazia

In [9]:
df_sistema_ponto = pd.DataFrame(data=None, columns=['emp_id', 'data', 'hora'])

##### Instalando a biblioteca para leitura de arquivos excel (final *.xlsx)

In [10]:
# !pip install openpyxl

##### Carregando os dados do registro de horas trabalhadas

In [11]:
for sheet in glob.glob('../arquivos/working-hours/*.xlsx'):
    df_ = pd.read_excel(sheet)
    df_sistema_ponto = pd.concat([df_sistema_ponto, df_])

In [12]:
df_sistema_ponto.head()

    emp_id                 data  hora
0  20001.0  2020-05-31 00:00:00  10.0
1  20001.0  2020-06-01 00:00:00  11.0
2  20001.0  2020-06-02 00:00:00   4.0
3  20001.0  2020-06-03 00:00:00   7.0
4  20001.0  2020-06-04 00:00:00   7.0

##### Convertendo os atributos para o tipo de dado datetime e numérico

In [22]:
df_sistema_ponto['data'] = pd.to_datetime(df_sistema_ponto['data'])
df_sistema_ponto['hora'] = pd.to_numeric(df_sistema_ponto['hora'])

##### Filtrando apenas os registros dos últimos 3 meses

In [35]:
df_last_3_month = df_sistema_ponto[(df_sistema_ponto['data'] > datetime.datetime(2020,9,30))]

##### Verificando a contagem de registros por colaborador

In [36]:
df_last_3_month.groupby('emp_id').count()

         data  hora
emp_id
10001.0    92    92
10002.0    92    92
10003.0    92    92
10004.0    92    92
10005.0    92    92
...       ...   ...
24996.0    92    92
24997.0    92    92
24998.0    92    92
24999.0    92    92
25000.0    92    92

[15000 rows x 2 columns]

##### Calculando o valor médio de horas nos últimos 3 meses

In [38]:
mean_work_last_3_months = df_last_3_month.groupby('emp_id')['hora'].agg('sum')/3

##### Atribuindo os dados ao DataFrame para a verificação

In [41]:
mean_work_last_3_months = pd.DataFrame(data=mean_work_last_3_months)

In [43]:
mean_work_last_3_months.rename(columns={'hora':'mean_work_last_3_months'}, inplace=True)

In [44]:
mean_work_last_3_months.head()

         mean_work_last_3_months
emp_id
10001.0               266.000000
10002.0               252.000000
10003.0               289.666667
10004.0               275.666667
10005.0               292.333333

#### Criando o atributo Time_in_Company

##### Definindo uma data de referência

In [45]:
date_referencia = datetime.date(2021, 1, 1)

##### Definindo a query para retornar os dados do banco de dados

In [46]:
query = """SELECT emp_no AS emp_id, hire_date FROM employees.employees"""

In [47]:
df_hire_date = pd.read_sql_query(query, engine)

In [48]:
df_hire_date.head()

   emp_id   hire_date
0   10001  2018-01-17
1   10002  2015-02-02
2   10003  2017-01-22
3   10004  2016-01-28
4   10005  2018-01-17

##### Convertendo o tipo de dados para datetime

In [49]:
df_hire_date['hire_date'] = pd.to_datetime(df_hire_date['hire_date'])

##### Calculando a diferença em dias a partir da data de contratação do colaborador até a data de referência

In [50]:
days_diff = []
for d in df_hire_date['hire_date']:
    diff = date_referencia - d.date()
    days_diff.append(diff.days)

In [ ]:
days_diff

##### Convertendo o número de dias em quantidade de anos

In [52]:
nyears = []
for ndays in days_diff:
    nyears.append(int(math.ceil(ndays / 365)))

In [ ]:
nyears

##### Atribuindo os dados ao DataFrame para verificação

In [54]:
df_hire_date['time_in_company'] = nyears

In [55]:
df_hire_date.head()

   emp_id  hire_date  time_in_company
0   10001 2018-01-17                3
1   10002 2015-02-02                6
2   10003 2017-01-22                4
3   10004 2016-01-28                5
4   10005 2018-01-17                3

#### Criando o atributo Work_Accident

##### Carregando os dados a partir do banco de dados

In [56]:
df_employees = pd.read_sql_table("employees", engine)

In [57]:
df_accident = pd.read_sql_table("accident", engine)

In [58]:
df_employees.head()

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

In [60]:
df_accident.head()

,emp_no,Event Description,Event Keywords,Human Factor
0,10019,"EMPLOYEE IS ELECTROCUTED, FALLS FROM A LADDER,...","RIB,ELECTRICAL,FRACTURE,LADDER,FALL",Other
1,10069,EMPLOYEE FALLS THROUGH HOLE IN ROOF AND IS KILLED,"SLIP,FALL PROTECTION,ROOF,FALL",Safety Devices Removed/Inoperable
2,10121,EMPLOYEE IS ASPHYXIATED INSIDE MANHOLE AND IS ...,"ASPHYXIATED,CONFINED SPACE,HYDROGEN SULFIDE,ME...",Insufficient /Lack/Respiratory Protection
3,10124,EMPLOYEE DIES FROM NATURAL CAUSES AFTER FALL A...,0,Other
4,10137,EMPLOYEE AMPUTATES FINGERS WHILE CLEANING MACH...,"CAUGHT IN,AMPUTATED,FAN BLADE,AMPUTATION,LOCKO...","Misjudgment, Hazardous Situation"

##### Verificando quais colaboradores sofreram acidente

In [63]:
work_accident = []
for emp in df_employees['emp_no']:
    if emp in df_accident['emp_no'].to_list():
        work_accident.append(1)
    else:
        work_accident.append(0)

##### Atribuindo ao DataFrame para verificação

In [66]:
df_work_accident = pd.DataFrame(data=None, columns=['emp_id', 'work_accident'])

In [67]:
df_work_accident['emp_id'] = df_employees['emp_no']
df_work_accident['work_accident'] = work_accident

In [70]:
df_work_accident.head()

   emp_id  work_accident
0   10001              0
1   10002              0
2   10003              0
3   10004              0
4   10005              0

#### Criando os atributos Department, Salary e Left

##### Definindo a query para retornar os atributos

In [71]:
query = """
    SELECT 
        emp.emp_no AS emp_id, 
        emp.department AS department, 
        sal.salary AS salary, 
        emp.left
    FROM employees emp
    INNER JOIN salaries sal ON emp.emp_no = sal.emp_id;
"""

In [72]:
df_department_salary_left = pd.read_sql_query(query, engine)

In [73]:
df_department_salary_left.head()

   emp_id department  salary  left
0   10001      sales     low     1
1   10002      sales  medium     1
2   10003      sales  medium     1
3   10004      sales     low     1
4   10005      sales     low     1